In [9]:
import numpy as np
import pandas as pd

In [10]:
data = {
    'v': [10, 60, 110, 160, 210],
    'w': [20, 70, 120, 170, 220],
    'x': [30, 80, 130, 180, 230],
    'y': [40, 90, 140, 190, 240],
    'z': [50, 100, 150, 200, 250]
}
index = ['a', 'b', 'c', 'd', 'e']
df = pd.DataFrame(data, index=index)
df

     v    w    x    y    z
a   10   20   30   40   50
b   60   70   80   90  100
c  110  120  130  140  150
d  160  170  180  190  200
e  210  220  230  240  250

In [11]:
df.loc['a']

v    10
w    20
x    30
y    40
z    50
Name: a, dtype: int64

In [12]:
df.loc[['a','b'],['x']]

    x
a  30
b  80

In [13]:
df.loc[df['x']>220]

     v    w    x    y    z
e  210  220  230  240  250

In [14]:
df.loc['b', df.loc['c'] > 125]

x     80
y     90
z    100
Name: b, dtype: int64

In [15]:
df.loc['b', df.loc['c'] > 125] = [12,14,16]
df

     v    w    x    y    z
a   10   20   30   40   50
b   60   70   12   14   16
c  110  120  130  140  150
d  160  170  180  190  200
e  210  220  230  240  250

In [16]:
df.loc['b', ['x','y']] = 98
df

     v    w    x    y    z
a   10   20   30   40   50
b   60   70   98   98   16
c  110  120  130  140  150
d  160  170  180  190  200
e  210  220  230  240  250